## Challenge 181: Employees Earning More than their Managers

Table: Employee


| Column Name | Type    |
|-------------|---------|
| id          | int     |
| name        | varchar |
| salary      | int     |
| managerId   | int     |

id is the primary key (column with unique values) for this table.
Each row of this table indicates the ID of an employee, their name, salary, and the ID of their manager.
 

Write a solution to find the employees who earn more than their managers.

Return the result table in any order.

The result format is in the following example.

 

Example 1:

Input: 
Employee table:

| id | name  | salary | managerId |
|----|-------|--------|-----------|
| 1  | Joe   | 70000  | 3         |
| 2  | Henry | 80000  | 4         |
| 3  | Sam   | 60000  | Null      |
| 4  | Max   | 90000  | Null      |

Output: 

| Employee |
|----------|
| Joe      |

Explanation: Joe is the only employee who earns more than his manager.

### Solution

In [1]:
import pandas as pd

In [4]:
employee = pd.DataFrame({
    'id':[1,2,3,4],
    'name': ['Joe','Henry','Sam','Max'],
    'salary': [70000,80000,60000,90000],
    'managerId': [3,4, None, None]
})

In [5]:
join_table = pd.merge(employee,employee,left_on='id',right_on='managerId',how='inner')

In [6]:
join_table

   id_x name_x  salary_x  managerId_x  id_y name_y  salary_y  managerId_y
0     3    Sam     60000          NaN     1    Joe     70000          3.0
1     4    Max     90000          NaN     2  Henry     80000          4.0

In [8]:
result = join_table[join_table['salary_y']>join_table['salary_x']][['name_y']].rename(columns={'name_y':'Employee'})

In [9]:
result

  Employee
0      Joe